/* _/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/

	FILE	: BubbleBase.cpp
	NAME	: Naoki_Nakamura

+ ------ Explanation of file --------------------------------------------------------------------------

	プレイヤーのシャボン玉ベース

+ _/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/ */

#include <windows.h>
#include <stdio.h>	// --- コンソール用

#include "Common.h"


// --- マウスポインタのX座標を取得
double BubbleBase::getMXposi() {
	double px = clickDownPt.x;
	return px;
}

// --- マウスポインタのY座標を取得
double BubbleBase::getMYposi() {
	double py = clickDownPt.y;
	return py;
}


/* ---------------------------------------------------------------- */
/*																	*/
/*			--- オブジェクトの表示・非表示フラグ取得 ---			*/
/*																	*/
/* ---------------------------------------------------------------- */
int BubbleBase::getUseFlg() {
	return m_flg;
}





